Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل يأمرهم بالمعروف وينهاهم عن المنكر ويحل لهم الطيبات ويحرم عليهم الخبائث ويضع عنهم إصرهم والأغلال التي كانت عليهم فالذين آمنوا به وعزروه ونصروه واتبعوا النور الذي أنزل معه أولئك هم المفلحون
en: Those who follow the Messenger, the Prophet who can neither read nor write (i.e. Muhammad صلى الله عليه وسلم) whom they find written with them in the Taurat (Torah) (Deut, xviii 15) and the Injeel (Gospel) (John xiv, 16) , - he commands them for Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam has ordained); and forbids them from Al-Munkar (i.e. disbelief, polytheism of all kinds, and all that Islam has forbidden); he allows them as lawful At-Tayyibat (i.e. all good and lawful as regards things, deeds, beliefs, persons, foods), and prohibits them as unlawful Al-Khaba'ith (i.e. all evil and unlawful as regards things, deeds, beliefs, persons and foods), he releases them from their heavy burdens (of Allah's Covenant with the children of Israel), and from the fetters (bindings) that were upon them. So those who believe in him (Muhammad صلى الله عليه وسلم), honour him, help him, and follow the light (the Qur'an) which has been sent down with him, it is they who will be successful .

source: قل يا أيها الناس إني رسول الله إليكم جميعا الذي له ملك السماوات والأرض لا إله إلا هو يحيي ويميت فآمنوا بالله ورسوله النبي الأمي الذي يؤمن بالله وكلماته واتبعوه لعلكم تهتدون
en: Say (O Muhammad صلى الله عليه وسلم): "O mankind! Verily, I am sent to you all as the Messenger of Allah - to Whom belongs the dominion of the heavens and the earth. La ilaha illa Huwa (none has the right to be worshipped but He). It is He Who gives life and causes death. So believe in Allah and His Messenger (Muhammad صلى الله عليه وسلم), the Prophet who can neither read nor write (i.e. Muhammad صلى الله عليه وسلم), who believes in Allah and His Words [(this Qur'an), the Taurat (Torah) and the Injeel (Gospel) and also Allah's Word: "Be!" - and he was, i.e. 'Îsa (Jesus) son of Maryam (Mary), عليهما السلام], and follow him so that you may be guided. "

source: ومن قوم موسى أمة يهدون بالحق وبه يعدلون
en: And of the people of Musa (Moses) there is a community who lead (the men) with truth and establish justice therewith (i.e. judge among men with truth and justice).

source: وقطعناهم اثنتي عشرة أسباطا أمما وأوحينا إلى موسى إذ استسقاه قومه أن اضرب بعصاك الحجر فانبجست منه اثنتا عشرة عينا قد علم كل أناس مشربهم وظللنا عليهم الغمام وأنزلنا عليهم المن والسلوى كلوا من طيبات ما رزقناكم وما ظلمونا ولكن كانوا أنفسهم يظلمون
en: And We divided them into twelve tribes (as distinct) nations. We revealed to Musa (Moses) when his people asked him for water (saying): "Strike the stone with your stick", and there gushed forth out of it twelve springs, each group knew its own place for water. We shaded them with the clouds and sent down upon them Al-Manna and the quails (saying): "Eat of the good things with which We have provided you." They harmed Us not but they used to harm themselves.

source: وإذ قيل لهم اسكنوا هذه القرية وكلوا منها حيث شئتم وقولوا حطة وادخلوا الباب سجدا نغفر لكم خطيئاتكم سنزيد المحسنين
en: And (remember) when it was said to them: "Dwell in this town (Jerusalem) and eat therefrom wherever you wish, and say, '(O Allah) forgive our sins'; and enter the gate prostrate (bowing with humility). We shall forgive you your wrong-doings. We shall increase (the reward) for the good-doers."

source: فبدل الذين ظلموا منهم قولا غير الذي قيل لهم فأرسلنا عليهم رجزا من السماء بما كانوا يظلمون
en: But those among them who did wrong changed the word that had been told to them. So We sent on them a torment from the heaven in return for their wrong-doings.

source: واسألهم عن القرية التي كانت حاضرة البحر إذ يعدون في السبت إذ تأتيهم حيتانهم يوم سبتهم شرعا ويوم لا يسبتون لا تأتيهم كذلك نبلوهم بما كانوا يفسقون
en: And ask them (O Muhammad صلى الله عليه وسلم) about the town that was by the sea; when they transgressed in the matter of the Sabbath (i.e. Saturday): when their fish came to them openly on the Sabbath day, and did not come to them on the day they had no Sabbath. Thus We made a trial of them, for they used to rebel against Allah's Command (disobey Allah) [see the Qur'an: V.4:154 and its footnote].

source: وإذ قالت أمة منهم لم تعظون قوما الله مهلكهم أو معذبهم عذابا شديدا قالوا معذرة إلى ربكم ولعلهم يتقون
en: And when a community among them said: "Why do you preach to a people whom Allah is about to destroy or to punish with a severe torment?" (The preachers) said: "In order to be free from guilt before your Lord (Allah), and perhaps they may fear Allah."

source: فلما نسوا ما ذكروا به أنجينا الذين ينهون عن السوء وأخذنا الذين ظلموا بعذاب بئيس بما كانوا يفسقون
en: So when they forgot the remindings that had been given to them, We rescued those who forbade evil, but We seized those who did wrong with a severe torment because they used to rebel against Allah's Command (disobey Allah).

source: فلما عتوا عن ما نهوا عنه قلنا لهم كونوا قردة خاسئين
en: So when they exceeded the limits of what they were prohibited, We said to them: "Be you monkeys, despised and rejected."

source: وإذ تأذن ربك ليبعثن عليهم إلى يوم القيامة من يسومهم سوء العذاب إن ربك لسريع العقاب وإنه لغفور رحيم
en: And (remember) when your Lord declared that He would certainly keep on sending against them (i.e. the Jews), till the Day of Resurrection, those who would afflict them with a humiliating torment. Verily, your Lord is Quick in Retribution (for the disobedient, wicked) and certainly He is Oft-Forgiving, Most Merciful (for the obedient and those who beg Allah's Forgiveness).

source: وقطعناهم في الأرض أمما منهم الصالحون ومنهم دون ذلك وبلوناهم بالحسنات والسيئات لعلهم يرجعون
en: And We have broken them (i.e. the Jews) up into various separate groups on the earth: some of them are righteous and some are away from that. And We tried them with good (blessings) and evil (calamities) in order that they might turn (to Allah's Obedience).

source: فخلف من بعدهم خلف ورثوا الكتاب يأخذون عرض هذا الأدنى ويقولون سيغفر لنا وإن يأتهم عرض مثله يأخذوه ألم يؤخذ عليهم ميثاق الكتاب أن لا يقولوا على الله إلا الحق ودرسوا ما فيه والدار الآخرة خير للذين يتقون أفلا تعقلون
en: Then after them succeeded an (evil) generation, which inherited the Book, but they chose (for themselves) the goods of this low life (evil pleasures of this world) saying (as an excuse): "(Everything) will be forgiven to us." And if (again) the offer of the like (evil pleasures of this world) came their way, they would (again) seize them (would commit those sins). Was not the covenant of the Book taken from them that they would not say about Allah anything but the truth? And they have studied what is in it (the Book). And the home of the Hereafter is better for those who are Al-Muttaqun (the pious - See V.2:2). Do not you then understand?

source: والذين يمسكون بالكتاب وأقاموا الصلاة إنا لا نضيع أجر المصلحين
en: And as to those who hold fast to the Book (i.e. act on its teachings) and perform As-Salat (Iqamat-as-Salat ), certainly We shall never waste the reward of those who do righteous deeds.

source: وإذ نتقنا الجبل فوقهم كأنه ظلة وظنوا أنه واقع بهم خذوا ما آتيناكم بقوة واذكروا ما فيه لعلكم تتقون
en: And (remember) when We raised the mountain over them as if it had been a canopy, and they thought that it was going to fall on them. (We said): "Hold firmly to what We have given you [i.e. the Taurat (Torah)], and remember that which is therein (act on its commandments), so that you may fear Allah and obey Him."

source: وإذ أخذ ربك من بني آدم من ظهورهم ذريتهم وأشهدهم على أنفسهم ألست بربكم قالوا بلى شهدنا أن تقولوا يوم القيامة إنا كنا عن هذا غافلين
en: And (remember) when your Lord brought forth from the Children of Adam, from their loins, their seed (or from Adam's loin his offspring) and made them testify as to themselves (saying): "Am I not your Lord?" They said: "Yes! We testify," lest you should say on the Day of Resurrection: "Verily, we have been unaware of this."

source: أو تقولوا إنما أشرك آباؤنا من قبل وكنا ذرية من بعدهم أفتهلكنا بما فعل المبطلون
en: Or lest you should say: "It was only our fathers afortime who took others as partners in worship along with Allah, and we were (merely their) descendants after them; will You then destroy us because of the deeds of men who practised Al-Batil (i.e. polytheism and committing crimes and sins, invoking and worshipping others besides Allah)?" (Tafsir At-Tabari).

source: وكذلك نفصل الآيات ولعلهم يرجعون
en: Thus do We explain the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail, so that they may turn (unto the truth).

source: واتل عليهم نبأ الذي آتيناه آياتنا فانسلخ منها فأتبعه الشيطان فكان من الغاوين
en: And recite (O Muhammad صلى الله عليه وسلم) to them the story of him to whom We gave Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), but he threw them away; so Shaitan (Satan) followed him up, and he became of those who went astray.

source: ولو شئنا لرفعناه بها ولكنه أخلد إلى الأرض واتبع هواه فمثله كمثل الكلب إن تحمل عليه يلهث أو تتركه يلهث ذلك مثل القوم الذين كذبوا بآياتنا فاقصص القصص لعلهم يتفكرون
en: And had We willed, We would surely have elevated him therewith but he clung to the earth and followed his own vain desire. So his parable is the parable of a dog: if you drive him away, he lolls his tongue out, or if you leave him alone, he (still) lolls his tongue out. Such is the parable of the people who reject Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.). So relate the stories, perhaps they may reflect.

source: ساء مثلا القوم الذين كذبوا بآياتنا وأنفسهم كانوا يظلمون
en: Evil is the parable of the people who rejected Our Ayat (proofs, evidence, verses and signs, etc.), and used to wrong their ownselves.

source: من يهد الله فهو المهتدي ومن يضلل فأولئك هم الخاسرون
en: Whomsoever Allah guides, he is the guided one, and whomsoever He sends astray,- then those! they are the losers.

source: ولقد ذرأنا لجهنم كثيرا من الجن والإنس لهم قلوب لا يفقهون بها ولهم أعين لا يبصرون بها ولهم آذان لا يسمعون بها أولئك كالأنعام بل هم أضل أولئك هم الغافلون
en: And surely, We have created many of the jinn and mankind for Hell. They have hearts wherewith they understand not, and they have eyes wherewith they see not, and they have ears wherewith they hear not (the truth). They are like cattle, nay even more astray; those! They are the heedless ones.

source: ولله الأسماء الحسنى فادعوه بها وذروا الذين يلحدون في أسمائه سيجزون ما كانوا يعملون
en: And (all) the Most Beautiful Names belong to Allah , so call on Him by them, and leave the company of those who belie or deny (or utter impious speech against) His Names. They will be requited for what they used to do.

source: وممن خلقنا أمة يهدون بالحق وبه يعدلون
en: And of those whom We have created, there is a community who guides (others) with the truth, and establishes justice therewith.

source: والذين كذبوا بآياتنا سنستدرجهم من حيث لا يعلمون
en: Those who reject Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), We shall gradually seize them with punishment in ways they perceive not.

source: وأملي لهم إن كيدي متين
en: And I respite them; certainly My Plan is strong.

source: أولم يتفكروا ما بصاحبهم من جنة إن هو إلا نذير مبين
en: Do they not reflect? There is no madness in their companion (Muhammad صلى الله عليه وسلم). He is but a plain warner.

source: أولم ينظروا في ملكوت السماوات والأرض وما خلق الله من شيء وأن عسى أن يكون قد اقترب أجلهم فبأي حديث بعده يؤمنون
en: Do they not look in the dominion of the heavens and the earth and all things that Allah has created; and that it may be that the end of their lives is near. In what message after this will they then believe?

source: من يضلل الله فلا هادي له ويذرهم في طغيانهم يعمهون
en: Whomsoever Allah sends astray, none can guide him; and He lets them wander blindly in their transgressions.

source: يسألونك عن الساعة أيان مرساها قل إنما علمها عند ربي لا يجليها لوقتها إلا هو ثقلت في السماوات والأرض لا تأتيكم إلا بغتة يسألونك كأنك حفي عنها قل إنما علمها عند الله ولكن أكثر الناس لا يعلمون
en: They ask you about the Hour (Day of Resurrection): "When will be its appointed time?" Say: "The knowledge thereof is with my Lord (Alone). None can reveal its time but He. Heavy is its burden through the heavens and the earth. It shall not come upon you except all of a sudden." They ask you as if you have a good knowledge of it. Say: "The knowledge thereof is with Allah (Alone), but most of mankind know not."

source: قل لا أملك لنفسي نفعا ولا ضرا إلا ما شاء الله ولو كنت أعلم الغيب لاستكثرت من الخير وما مسني السوء إن أنا إلا نذير وبشير لقوم يؤمنون
en: Say (O Muhammad صلى الله عليه وسلم): "I possess no power over benefit or harm to myself except as Allah wills. If I had the knowledge of the Ghaib (Unseen), I should have secured for myself an abundance of wealth, and no evil should have touched me. I am but a warner, and a bringer of glad tidings unto people who believe."

source: هو الذي خلقكم من نفس واحدة وجعل منها زوجها ليسكن إليها فلما تغشاها حملت حملا خفيفا فمرت به فلما أثقلت دعوا الله ربهما لئن آتيتنا صالحا لنكونن من الشاكرين
en: It is He Who has created you from a single person (Adam), and (then) He has created from him his wife [Hawwa' (Eve)], in order that he might enjoy the pleasure of living with her. When he (a polytheist from Adam's offspring - as stated by Ibn Kathir in his Tafsir) had sexual relation with her (the polytheist's wife), she became pregnant and she carried it about lightly. Then when it became heavy, they both invoked Allah, their Lord (saying): "If You give us a Salih (good in every aspect) child, we shall indeed be among the grateful."

source: فلما آتاهما صالحا جعلا له شركاء فيما آتاهما فتعالى الله عما يشركون
en: But when He gave them (the polytheist and his wife) a Salih (good in every aspect) child, they ascribed partners to Him (Allah) in that which He has given to them. High be Allah, Exalted above all that they ascribe as partners to Him. (Tafsir Ibn Kathir).

source: أيشركون ما لا يخلق شيئا وهم يخلقون
en: Do they attribute as partners to Allah those who created nothing but they themselves are created?

source: ولا يستطيعون لهم نصرا ولا أنفسهم ينصرون
en: No help can they give them, nor can they help themselves.

source: وإن تدعوهم إلى الهدى لا يتبعوكم سواء عليكم أدعوتموهم أم أنتم صامتون
en: And if you call them to guidance, they follow you not. It is the same for you whether you call them or you keep silent.

source: إن الذين تدعون من دون الله عباد أمثالكم فادعوهم فليستجيبوا لكم إن كنتم صادقين
en: Verily, those whom you call upon besides Allah are slaves like you. So call upon them and let them answer you if you are truthful.

source: ألهم أرجل يمشون بها أم لهم أيد يبطشون بها أم لهم أعين يبصرون بها أم لهم آذان يسمعون بها قل ادعوا شركاءكم ثم كيدون فلا تنظرون
en: Have they feet wherewith they walk? Or have they hands wherewith they hold? Or have they eyes wherewith they see? Or have they ears wherewith they hear? Say (O Muhammad صلى الله عليه وسلم): "Call your (so-called) partners (of Allah) and then plot against me, and give me no respite!

source: إن وليي الله الذي نزل الكتاب وهو يتولى الصالحين
en: Verily, my Wali (Protector, Supporter, and Helper) is Allah Who has revealed the Book (the Qur'an), and He protects (supports and helps) the righteous.

source: والذين تدعون من دونه لا يستطيعون نصركم ولا أنفسهم ينصرون
en: And those whom you call upon besides Him (Allah) cannot help you nor can they help themselves.

source: وإن تدعوهم إلى الهدى لا يسمعوا وتراهم ينظرون إليك وهم لا يبصرون
en: And if you call them to guidance, they hear not and you will see them looking at you, yet they see not.

source: خذ العفو وأمر بالعرف وأعرض عن الجاهلين
en: Show forgiveness, enjoin what is good, and turn away from the foolish (i.e. don't punish them).

source: وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه سميع عليم
en: And if an evil whisper comes to you from Shaitan (Satan), then seek refuge with Allah. Verily, He is All-Hearer, All-Knower.

source: إن الذين اتقوا إذا مسهم طائف من الشيطان تذكروا فإذا هم مبصرون
en: Verily, those who are Al-Muttaqun (the pious - see V.2:2), when an evil thought comes to them from Shaitan (Satan), they remember (Allah), and (indeed) they then see (aright).

source: وإخوانهم يمدونهم في الغي ثم لا يقصرون
en: But (as for) their brothers (the devils) they (i.e. the devils) plunge them deeper into error, and they never stop short.

source: وإذا لم تأتهم بآية قالوا لولا اجتبيتها قل إنما أتبع ما يوحى إلي من ربي هذا بصائر من ربكم وهدى ورحمة لقوم يؤمنون
en: And if you do not bring them a miracle [according to their (i.e. Quraish-pagans') proposal], they say: "Why have you not brought it?" Say: "I but follow what is revealed to me from my Lord. This (the Qur'an) is nothing but evidence from your Lord, and a guidance and a mercy for a people who believe."

source: وإذا قرئ القرآن فاستمعوا له وأنصتوا لعلكم ترحمون
en: So, when the Qur'an is recited, listen to it, and be silent that you may receive mercy. [i.e. during the compulsory congregational prayers when the Imam (of a mosque) is leading the prayer (except Surat Al-Fatihah), and also when he is delivering the Friday-prayer Khutbah]. (Tafsir At-Tabari).

source: واذكر ربك في نفسك تضرعا وخيفة ودون الجهر من القول بالغدو والآصال ولا تكن من الغافلين
en: And remember your Lord within yourself, humbly and with fear and without loudness in words in the mornings, and in the afternoons and be not of those who are neglectful.

source: إن الذين عند ربك لا يستكبرون عن عبادته ويسبحونه وله يسجدون
en: Surely, those who are with your Lord (angels) are never too proud to perform acts of worship to Him, but they glorify His Praise and prostrate themselves before Him.

source: يسألونك عن الأنفال قل الأنفال لله والرسول فاتقوا الله وأصلحوا ذات بينكم وأطيعوا الله ورسوله إن كنتم مؤمنين
en: They ask you (O Muhammad صلى الله عليه وسلم) about the spoils of war. Say: "The spoils are for Allah and the Messenger." So fear Allah and adjust all matters of difference among you, and obey Allah and His Messenger (Muhammad صلى الله عليه وسلم), if you are believers.

source: إنما المؤمنون الذين إذا ذكر الله وجلت قلوبهم وإذا تليت عليهم آياته زادتهم إيمانا وعلى ربهم يتوكلون
en: The believers are only those who, when Allah is mentioned, feel a fear in their hearts and when His Verses (this Qur'an) are recited unto them, they (i.e. the Verses) increase their Faith; and they put their trust in their Lord (Alone);

source: الذين يقيمون الصلاة ومما رزقناهم ينفقون
en: Who perform As-Salat (Iqamat-as-Salat) and spend out of that We have provided them.

source: أولئك هم المؤمنون حقا لهم درجات عند ربهم ومغفرة ورزق كريم
en: It is they who are the believers in truth. For them are grades of dignity with their Lord, and Forgiveness and a generous provision (Paradise).

source: كما أخرجك ربك من بيتك بالحق وإن فريقا من المؤمنين لكارهون
en: As your Lord caused you (O Muhammad صلى الله عليه وسلم) to go out from your home with the truth; and verily, a party among the believers disliked it,

source: يجادلونك في الحق بعدما تبين كأنما يساقون إلى الموت وهم ينظرون
en: Disputing with you concerning the truth after it was made manifest, as if they were being driven to death, while they were looking (at it).

source: وإذ يعدكم الله إحدى الطائفتين أنها لكم وتودون أن غير ذات الشوكة تكون لكم ويريد الله أن يحق الحق بكلماته ويقطع دابر الكافرين
en: And (remember) when Allah promised you (Muslims) one of the two parties (of the enemy i.e. either the army or the caravan) that it should be yours; you wished that the one not armed (the caravan) should be yours, but Allah willed to justify the truth by His Words and to cut off the roots of the disbelievers (i.e. in the battle of Badr).

source: ليحق الحق ويبطل الباطل ولو كره المجرمون
en: That He might cause the truth to triumph and bring falsehood to nothing, even though the Mujrimun (disbelievers, polytheists, sinners, criminals) hate it.

source: إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين
en: (Remember) when you sought help of your Lord and He answered you (saying): "I will help you with a thousand of the angels each behind the other (following one another) in succession."

source: وما جعله الله إلا بشرى ولتطمئن به قلوبكم وما النصر إلا من عند الله إن الله عزيز حكيم
en: Allah made it only as glad tidings, and that your hearts be at rest therewith. And there is no victory except from Allah. Verily, Allah is All-Mighty, All-Wise.

source: إذ يغشيكم النعاس أمنة منه وينزل عليكم من السماء ماء ليطهركم به ويذهب عنكم رجز الشيطان وليربط على قلوبكم ويثبت به الأقدام
en: (Remember) when He covered you with a slumber as a security from Him, and He caused water (rain) to descend on you from the sky, to clean you thereby and to remove from you the Rijz (whispering, evil-suggestions) of Shaitan (Satan), and to strengthen your hearts, and make your feet firm thereby.

source: إذ يوحي ربك إلى الملائكة أني معكم فثبتوا الذين آمنوا سألقي في قلوب الذين كفروا الرعب فاضربوا فوق الأعناق واضربوا منهم كل بنان
en: (Remember) when your Lord revealed to the angels, "Verily, I am with you, so keep firm those who have believed. I will cast terror into the hearts of those who have disbelieved, so strike them over the necks, and smite over all their fingers and toes."

source: ذلك بأنهم شاقوا الله ورسوله ومن يشاقق الله ورسوله فإن الله شديد العقاب
en: This is because they defied and disobeyed Allah and His Messenger. And whoever defies and disobeys Allah and His Messenger, then verily, Allah is Severe in punishment.

source: ذلكم فذوقوه وأن للكافرين عذاب النار
en: This is (the torment), so taste it; and surely for the disbelievers is the torment of the Fire.

source: يا أيها الذين آمنوا إذا لقيتم الذين كفروا زحفا فلا تولوهم الأدبار
en: O you who believe! When you meet those who disbelieve, in a battle-field, never turn your backs to them.

source: ومن يولهم يومئذ دبره إلا متحرفا لقتال أو متحيزا إلى فئة فقد باء بغضب من الله ومأواه جهنم وبئس المصير
en: And whoever turns his back to them on such a day - unless it be a stratagem of war, or to retreat to a troop (of his own), - he indeed has drawn upon himself wrath from Allah. And his abode is Hell, and worst indeed is that destination!

source: فلم تقتلوهم ولكن الله قتلهم وما رميت إذ رميت ولكن الله رمى وليبلي المؤمنين منه بلاء حسنا إن الله سميع عليم
en: You killed them not, but Allah killed them. And you (Muhammad صلى الله عليه وسلم) threw not when you did throw, but Allah threw, that He might test the believers by a fair trial from Him. Verily, Allah is All-Hearer, All-Knower.

source: ذلكم وأن الله موهن كيد الكافرين
en: This (is the fact) and surely, Allah weakens the deceitful plots of the disbelievers.

source: إن تستفتحوا فقد جاءكم الفتح وإن تنتهوا فهو خير لكم وإن تعودوا نعد ولن تغني عنكم فئتكم شيئا ولو كثرت وأن الله مع المؤمنين
en: (O disbelievers) if you ask for a judgement, now has the judgement come unto you; and if you cease (to do wrong), it will be better for you, and if you return (to the attack), so shall We return, and your forces will be of no avail to you, however numerous they be; and verily, Allah is with the believers.

source: يا أيها الذين آمنوا أطيعوا الله ورسوله ولا تولوا عنه وأنتم تسمعون
en: O you who believe! Obey Allah and His Messenger, and turn not away from him (i.e. Messenger Muhammad صلى الله عليه وسلم) while you are hearing.

source: ولا تكونوا كالذين قالوا سمعنا وهم لا يسمعون
en: And be not like those who say: "We have heard," but they hear not.

source: إن شر الدواب عند الله الصم البكم الذين لا يعقلون
en: Verily! The worst of (moving) living creatures with Allah are the deaf and the dumb, who understand not (i.e. the disbelievers).
